InformationRegisters/MRS_ПроцессыELMA.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>MRS_ПроцессыELMA</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УИДЕЛМА</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.MRS_СтатусыСинхронизацииELMA</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КомментарийЕЛМА</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Запрос</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Документ1С</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>URLProcess</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаПоследнейПопытки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаПоследнегоОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>UidДокумента1С</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/MRS_ИнтеграцияЕЛМАСервер/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// MRS_ИнтеграцияЕЛМАСервер: Серверный модуль интеграции с системой ЕЛМА
//
// Обеспечивает:
// - Авторизацию в ЕЛМА через REST API
// - Отправку документов "Установка цен номенклатуры" в ЕЛМА
// - Опрос и синхронизацию статусов процессов согласования
// - Автоматическое проведение документов при подписании приказов
// - Выгрузку цен в Simphony после проведения
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область РегламентныеПроцедуры

// Главная функция регламентного задания интеграции с ЕЛМА
// Выполняет последовательно:
// 1. Обработку очереди отправки документов
// 2. Опрос статусов процессов в ЕЛМА
// 3. Проведение документов по дате применения
//
Процедура ВыполнитьИнтеграциюЕЛМА() Экспорт
	
	ЗаписатьЛог("Запуск регламентного задания интеграции с ЕЛМА", УровеньЖурналаРегистрации.Информация);
	
	// 1. Обработка очереди отправки
	Попытка
		
		РезультатОтправки = ОбработатьОчередьОтправки();
		ЗаписатьЛог(СтрШаблон("Обработка очереди завершена. Отправлено: %1, Ошибок: %2", 
			РезультатОтправки.Отправлено, РезультатОтправки.Ошибок), УровеньЖурналаРегистрации.Информация);
		
	Исключение
		
		ЗаписатьЛог("Ошибка при обработке очереди отправки: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),
			УровеньЖурналаРегистрации.Ошибка);
		
	КонецПопытки;
	
	// 2. Опрос статусов процессов
	Попытка
		
		РезультатОпроса = ОпроситьСтатусыДокументов();
		ЗаписатьЛог(СтрШаблон("Опрос статусов завершен. Обновлено: %1, Ошибок: %2", 
			РезультатОпроса.Обновлено, РезультатОпроса.Ошибок), УровеньЖурналаРегистрации.Информация);
		
	Исключение
		
		ЗаписатьЛог("Ошибка при опросе статусов: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),
			УровеньЖурналаРегистрации.Ошибка);
		
	КонецПопытки;
	
	// 3. Проведение документов по дате применения
	Попытка
		
		РезультатПроведения = ПровестиДокументыПоДатеПрименения();
		ЗаписатьЛог(СтрШаблон("Проведение документов завершено. Проведено: %1, Ошибок: %2", 
			РезультатПроведения.Проведено, РезультатПроведения.Ошибок), УровеньЖурналаРегистрации.Информация);
		
	Исключение
		
		ЗаписатьЛог("Ошибка при проведении документов: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()),
			УровеньЖурналаРегистрации.Ошибка);
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСОчередью

// Проверяет необходимость отправки документа в ЕЛМА при проведении
// Вызывается из подписки ПередЗаписью документа УстановкаЦенНоменклатуры
//
// Параметры:
//  Документ - ДокументОбъект.УстановкаЦенНоменклатуры - проводимый документ
//  Отказ - Булево - флаг отказа от записи
//
Процедура ПроверитьНеобходимостьОтправкиВЕЛМА(Документ, Отказ) Экспорт
	
	// Проверяем, нужна ли отправка в ЕЛМА
	// ЕСЛИ ВидЦены привязан к питУдаленныеКассы → открыть форму параметров приказа
	Если НЕ ТребуетсяОтправкаВЕЛМА(Документ) Тогда
		Возврат;
	КонецЕсли;
	
	// Открытие формы параметров приказа будет реализовано на клиенте
	// через механизм ПриЗаписиНаСервере с интерактивной формой
	
КонецПроцедуры

// Ставит документ в очередь на отправку в ЕЛМА
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.УстановкаЦенНоменклатуры - документ для отправки
//  ПараметрыПриказа - Структура - параметры приказа из формы:
//   * ОтветственныйЗаИсполнение - СправочникСсылка.ФизическиеЛица
//   * СписокКОзнакомлению - ТаблицаЗначений с колонкой ФизическоеЛицо
//
// Возвращаемое значение:
//  Булево - Истина если документ поставлен в очередь
//
Функция ПоставитьДокументВОчередьЕЛМА(ДокументСсылка, ПараметрыПриказа) Экспорт
	
	Попытка
		
		// Валидация параметров
		РезультатВалидации = ВалидироватьДокументПередОтправкой(ДокументСсылка, ПараметрыПриказа);
		Если НЕ РезультатВалидации.Успех Тогда
			
			// Формируем текст ошибки из массива
			ТекстОшибки = СтрСоединить(РезультатВалидации.МассивОшибок, Символы.ПС);
			ВызватьИсключение ТекстОшибки;
			
		КонецЕсли;
		
		// Создание записи в регистре MRS_ПроцессыЕЛМА
		НаборЗаписей = РегистрыСведений.MRS_ПроцессыЕЛМА.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Документ1С.Установить(ДокументСсылка);
		
		Запись = НаборЗаписей.Добавить();
		Запись.Документ1С = ДокументСсылка;
		Запись.Статус = Перечисления.MRS_СтатусыСинхронизацииЕЛМА.ВОчереди;
		Запись.ДатаПоследнейПопытки = ТекущаяДатаСеанса();
		Запись.КоличествоПопыток = 0;
		
		// Сохраняем параметры приказа во временном хранилище
		// Они понадобятся при формировании JSON
		АдресПараметров = ПоместитьВоВременноеХранилище(ПараметрыПриказа);
		Запись.ТекстОшибки = АдресПараметров; // Временно используем это поле
		
		НаборЗаписей.Записать();
		
		ЗаписатьЛог(СтрШаблон("Документ %1 поставлен в очередь ЕЛМА", ДокументСсылка), 
			УровеньЖурналаРегистрации.Информация);
		
		Возврат Истина;
		
	Исключение
		
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписатьЛог("Ошибка постановки документа в очередь ЕЛМА: " + ТекстОшибки, 
			УровеньЖурналаРегистрации.Ошибка);
		
		Возврат Ложь;
		
	КонецПопытки;
	
КонецФункции

// Обрабатывает очередь документов на отправку в ЕЛМА
//
// Возвращаемое значение:
//  Структура:
//   * Отправлено - Число - количество успешно отправленных документов
//   * Ошибок - Число - количество ошибок
//
Функция ОбработатьОчередьОтправки() Экспорт
	
	Результат = Новый Структура("Отправлено, Ошибок", 0, 0);
	
	// Авторизация в ЕЛМА
	РезультатАвторизации = АвторизоватьсяВЕЛМА();
	Если НЕ РезультатАвторизации.Успех Тогда
		ЗаписатьЛог("Не удалось авторизоваться в ЕЛМА: " + РезультатАвторизации.ТекстОшибки, 
			УровеньЖурналаРегистрации.Ошибка);
		Возврат Результат;
	КонецЕсли;
	
	AuthToken = РезультатАвторизации.Токен;
	
	// Выборка документов из очереди (максимум 10 за раз)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 10
		|	ПроцессыЕЛМА.Документ1С КАК Документ1С,
		|	ПроцессыЕЛМА.КоличествоПопыток КАК КоличествоПопыток,
		|	ПроцессыЕЛМА.ТекстОшибки КАК АдресПараметров
		|ИЗ
		|	РегистрСведений.MRS_ПроцессыЕЛМА КАК ПроцессыЕЛМА
		|ГДЕ
		|	(ПроцессыЕЛМА.Статус = ЗНАЧЕНИЕ(Перечисление.MRS_СтатусыСинхронизацииЕЛМА.ВОчереди)
		|		ИЛИ ПроцессыЕЛМА.Статус = ЗНАЧЕНИЕ(Перечисление.MRS_СтатусыСинхронизацииЕЛМА.Ошибка)
		|			И ПроцессыЕЛМА.КоличествоПопыток < 3)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПроцессыЕЛМА.ДатаПоследнейПопытки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			
			// Восстанавливаем параметры приказа из временного хранилища
			ПараметрыПриказа = ПолучитьИзВременногоХранилища(Выборка.АдресПараметров);
			
			// Отправка в ЕЛМА
			РезультатОтправки = ОтправитьВЕЛМА(Выборка.Документ1С, AuthToken, ПараметрыПриказа);
			
			Если РезультатОтправки.Успех Тогда
				
				// Обновление записи в регистре
				НаборЗаписей = РегистрыСведений.MRS_ПроцессыЕЛМА.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Документ1С.Установить(Выборка.Документ1С);
				НаборЗаписей.Прочитать();
				
				Если НаборЗаписей.Количество() > 0 Тогда
					
					Запись = НаборЗаписей[0];
					Запись.УИДЕЛМА = РезультатОтправки.УИДЕЛМА;
					Запись.Статус = Перечисления.MRS_СтатусыСинхронизацииЕЛМА.НаСогласовании;
					Запись.ДатаОтправки = ТекущаяДатаСеанса();
					Запись.ТекстОшибки = "";
					Запись.КоличествоПопыток = 0;
					
					НаборЗаписей.Записать();
					
				КонецЕсли;
				
				Результат.Отправлено = Результат.Отправлено + 1;
				
			Иначе
				
				// Обработка ошибки
				НаборЗаписей = РегистрыСведений.MRS_ПроцессыЕЛМА.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Документ1С.Установить(Выборка.Документ1С);
				НаборЗаписей.Прочитать();
				
				Если НаборЗаписей.Количество() > 0 Тогда
					
					Запись = НаборЗаписей[0];
					Запись.КоличествоПопыток = Запись.КоличествоПопыток + 1;
					Запись.ТекстОшибки = РезультатОтправки.ТекстОшибки;
					Запись.ДатаПоследнейПопытки = ТекущаяДатаСеанса();
					
					Если Запись.КоличествоПопыток >= 3 Тогда
						Запись.Статус = Перечисления.MRS_СтатусыСинхронизацииЕЛМА.ТребуетВнимания;
					Иначе
						Запись.Статус = Перечисления.MRS_СтатусыСинхронизацииЕЛМА.Ошибка;
					КонецЕсли;
					
					НаборЗаписей.Записать();
					
				КонецЕсли;
				
				Результат.Ошибок = Результат.Ошибок + 1;
				
			КонецЕсли;
			
		Исключение
			
			ЗаписатьЛог(СтрШаблон("Ошибка отправки документа %1: %2", 
				Выборка.Документ1С, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())), 
				УровеньЖурналаРегистрации.Ошибка);
			Результат.Ошибок = Результат.Ошибок + 1;
			
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область РабораСоСтатусами

// Опрашивает статусы процессов в ЕЛМА и обновляет их в 1С
//
// Возвращаемое значение:
//  Структура:
//   * Обновлено - Число - количество обновленных статусов
//   * Ошибок - Число - количество ошибок
//
Функция ОпроситьСтатусыДокументов() Экспорт
	
	Результат = Новый Структура("Обновлено, Ошибок", 0, 0);
	
	// Авторизация в ЕЛМА
	РезультатАвторизации = АвторизоватьсяВЕЛМА();
	Если НЕ РезультатАвторизации.Успех Тогда
		Возврат Результат;
	КонецЕсли;
	
	AuthToken = РезультатАвторизации.Токен;
	
	// Выборка документов для опроса (те, у которых процесс не завершен)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроцессыЕЛМА.Документ1С КАК Документ1С,
		|	ПроцессыЕЛМА.УИДЕЛМА КАК УИДЕЛМА,
		|	ПроцессыЕЛМА.Статус КАК Статус,
		|	ПроцессыЕЛМА.ДатаПоследнегоОпроса КАК ДатаПоследнегоОпроса
		|ИЗ
		|	РегистрСведений.MRS_ПроцессыЕЛМА КАК ПроцессыЕЛМА
		|ГДЕ
		|	ПроцессыЕЛМА.УИДЕЛМА <> """"
		|	И НЕ ПроцессыЕЛМА.Статус В (ЗНАЧЕНИЕ(Перечисление.MRS_СтатусыСинхронизацииЕЛМА.Подписан),
		|		ЗНАЧЕНИЕ(Перечисление.MRS_СтатусыСинхронизацииЕЛМА.Отклонен),
		|		ЗНАЧЕНИЕ(Перечисление.MRS_СтатусыСинхронизацииЕЛМА.Отменен))
		|	И (ПроцессыЕЛМА.ДатаПоследнегоОпроса < &ДатаГраницы
		|		ИЛИ ПроцессыЕЛМА.ДатаПоследнегоОпроса = ДАТАВРЕМЯ(1, 1, 1))";
	
	ДатаГраницы = ТекущаяДатаСеанса() - 300; // 5 минут назад
	Запрос.УстановитьПараметр("ДатаГраницы", ДатаГраницы);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			
			// Получение статуса из ЕЛМА
			РезультатОпроса = ПолучитьСтатусИзЕЛМА(Выборка.УИДЕЛМА, AuthToken);
			
			Если РезультатОпроса.Успех Тогда
				
				// Обновление статуса в регистре
				НаборЗаписей = РегистрыСведений.MRS_ПроцессыЕЛМА.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Документ1С.Установить(Выборка.Документ1С);
				НаборЗаписей.Прочитать();
				
				Если НаборЗаписей.Количество() > 0 Тогда
					
					Запись = НаборЗаписей[0];
					
					СтарыйСтатус = Запись.Статус;
					НовыйСтатус = ПреобразоватьСтатусЕЛМАВСтатус1С(РезультатОпроса.СтатусЕЛМА);
					
					Запись.СтатусЕЛМА = РезультатОпроса.СтатусЕЛМА;
					Запись.Статус = НовыйСтатус;
					Запись.ДатаПоследнегоОпроса = ТекущаяДатаСеанса();
					
					Если ЗначениеЗаполнено(РезультатОпроса.Комментарий) Тогда
						Запись.КомментарийЕЛМА = РезультатОпроса.Комментарий;
					КонецЕсли;
					
					НаборЗаписей.Записать();
					
					// Отправка уведомления при изменении статуса
					Если СтарыйСтатус <> НовыйСтатус Тогда
						ОтправитьEmailУведомлениеОСменеСтатуса(Выборка.Документ1С, НовыйСтатус);
					КонецЕсли;
					
				КонецЕсли;
				
				Результат.Обновлено = Результат.Обновлено + 1;
				
			Иначе
				
				ЗаписатьЛог(СтрШаблон("Ошибка опроса статуса для УИДЕЛМА %1: %2", 
					Выборка.УИДЕЛМА, РезультатОпроса.ТекстОшибки), 
					УровеньЖурналаРегистрации.Предупреждение);
				Результат.Ошибок = Результат.Ошибок + 1;
				
			КонецЕсли;
			
		Исключение
			
			ЗаписатьЛог(СтрШаблон("Ошибка опроса статуса для документа %1: %2", 
				Выборка.Документ1С, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())), 
				УровеньЖурналаРегистрации.Ошибка);
			Результат.Ошибок = Результат.Ошибок + 1;
			
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Получает текущий статус документа из регистра MRS_ПроцессыЕЛМА
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.УстановкаЦенНоменклатуры
//
// Возвращаемое значение:
//  ПеречислениеСсылка.MRS_СтатусыСинхронизацииЕЛМА - текущий статус или Неопределено
//
Функция ПолучитьСтатусДокумента(ДокументСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	 |	MRS_ПроцессыELMA.УстановкаЦен КАК УстановкаЦен,
	 |	MRS_ПроцессыELMA.УИДЕЛМА КАК УИДЕЛМА,
	 |	MRS_ПроцессыELMA.Статус КАК Статус,
	 |	MRS_ПроцессыELMA.ДатаОтправки КАК ДатаОтправки,
	 |	MRS_ПроцессыELMA.КомментарийЕЛМА КАК КомментарийЕЛМА
	 |ИЗ
	 |	РегистрСведений.MRS_ПроцессыELMA КАК MRS_ПроцессыELMA
	 |ГДЕ
	 |	MRS_ПроцессыELMA.УстановкаЦен = &Документ1С";
	
	Запрос.УстановитьПараметр("Документ1С", ДокументСсылка);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	СтруктураСтатуса = Новый Структура;
	СтруктураСтатуса.Вставить("Статус", Выборка.Статус);
	СтруктураСтатуса.Вставить("УИДЕЛМА", Выборка.УИДЕЛМА);
	СтруктураСтатуса.Вставить("ДатаОтправки", Выборка.ДатаОтправки);
	СтруктураСтатуса.Вставить("КомментарийЕЛМА", Выборка.КомментарийЕЛМА);
	
	Возврат СтруктураСтатуса;
	
КонецФункции

// Получает ранее сохраненные параметры приказа для документа
// Используется для предзаполнения формы параметров при повторной отправке
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.УстановкаЦенНоменклатуры - документ
//
// Возвращаемое значение:
//  Структура, Неопределено - параметры приказа или Неопределено если не найдено
//   * ОтветственныйЗаИсполнение - СправочникСсылка.ФизическиеЛица
//   * СписокКОзнакомлению - ТаблицаЗначений
//   * ДатаНачалаДействия - Дата
//
Функция ПолучитьСохраненныеПараметрыПриказа(ДокументСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	MRS_ПроцессыELMA.ТекстОшибки КАК АдресВоВременномХранилище
	|ИЗ
	|	РегистрСведений.MRS_ПроцессыELMA КАК MRS_ПроцессыELMA
	|ГДЕ
	|	MRS_ПроцессыELMA.УстановкаЦен = &Документ1С";
	
	Запрос.УстановитьПараметр("Документ1С", ДокументСсылка);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	// Параметры приказа временно сохранены во временном хранилище
	// Адрес хранилища записан в поле ТекстОшибки (временное решение)
	АдресВоВременномХранилище = Выборка.АдресВоВременномХранилище;
	
	Если ПустаяСтрока(АдресВоВременномХранилище) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		
		// Пытаемся получить параметры из временного хранилища
		ПараметрыПриказа = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
		
		Если ТипЗнч(ПараметрыПриказа) = Тип("Структура") Тогда
			Возврат ПараметрыПриказа;
		КонецЕсли;
		
	Исключение
		// Временное хранилище может быть недоступно (устарело)
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область РаботаСЕЛМА_API

// Выполняет авторизацию в системе ЕЛМА и получает AuthToken
//
// Возвращаемое значение:
//  Структура:
//   * Успех - Булево
//   * Токен - Строка - AuthToken при успехе
//   * ТекстОшибки - Строка - описание ошибки при неудаче
//
Функция АвторизоватьсяВЕЛМА() Экспорт
	
	Результат = Новый Структура("Успех, Токен, ТекстОшибки", Ложь, "", "");
	
	Попытка
		
		// Получение параметров подключения из констант
		URL = ПЛ_ДополнительныеКонстантыПовтИсп.ВернутьДополнительнуюКонстанту("MRS_URLСервисаЕЛМА");
		ApplicationToken = ПЛ_ДополнительныеКонстантыПовтИсп.ВернутьДополнительнуюКонстанту("MRS_ApplicationTokenЕЛМА");
		Логин = ПЛ_ДополнительныеКонстантыПовтИсп.ВернутьДополнительнуюКонстанту("MRS_ИмяПользователяЕЛМА");
		Пароль = ПЛ_ДополнительныеКонстантыПовтИсп.ВернутьДополнительнуюКонстанту("MRS_ПарольЕЛМА");
		Таймаут = Число(ПЛ_ДополнительныеКонстантыПовтИсп.ВернутьДополнительнуюКонстанту("MRS_ТаймаутЗапросаЕЛМА", 30));
		
		Если НЕ ЗначениеЗаполнено(URL) Или НЕ ЗначениеЗаполнено(ApplicationToken) 
			Или НЕ ЗначениеЗаполнено(Логин) Или НЕ ЗначениеЗаполнено(Пароль) Тогда
			
			Результат.ТекстОшибки = "Не заполнены параметры подключения к ЕЛМА в РС.ДополнительныеКонстанты";
			Возврат Результат;
			
		КонецЕсли;
		
		// Формирование URL запроса
		ПолныйURL = URL + "/API/REST/Authorization/LoginWith?username=" + Логин;
		
		// Разбор URL для создания соединения
		СтруктураURL = СтроковыеФункцииКлиентСервер.СтруктураURI(URL);
		
		// Создание защищенного соединения для HTTPS
		ЗащищенноеСоединение = Неопределено;
		Если СтруктураURL.Схема = "https" Тогда
			ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено);
		КонецЕсли;
		
		// Создание HTTP-соединения
		Соединение = Новый HTTPСоединение(
			СтруктураURL.Имя,
			СтруктураURL.Порт,
			,
			,
			,
			Таймаут,
			ЗащищенноеСоединение);
		
		HTTPЗапрос = Новый HTTPЗапрос("/API/REST/Authorization/LoginWith?username=" + Логин);
		
		HTTPЗапрос.Заголовки.Вставить("ApplicationToken", ApplicationToken);
		HTTPЗапрос.Заголовки.Вставить("Content-Type", "text/plain; charset=utf-8");
		HTTPЗапрос.УстановитьТелоИзСтроки(Пароль, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
		
		// Выполнение запроса
		HTTPОтвет = Соединение.ВызватьHTTPМетод("POST", HTTPЗапрос);
		
		// Обработка ответа
		Если HTTPОтвет.КодСостояния = 200 Тогда
			
			ТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку("utf-8");
			
			// Парсинг JSON
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
			ОтветJSON = ПрочитатьJSON(ЧтениеJSON);
			ЧтениеJSON.Закрыть();
			
			Если ТипЗнч(ОтветJSON) = Тип("Структура") И ОтветJSON.Свойство("AuthToken") Тогда
				
				Результат.Успех = Истина;
				Результат.Токен = ОтветJSON.AuthToken;
				
			ИначеЕсли ТипЗнч(ОтветJSON) = Тип("Строка") Тогда
				
				// Иногда ЕЛМА возвращает токен просто строкой
				Результат.Успех = Истина;
				Результат.Токен = ОтветJSON;
				
			Иначе
				
				Результат.ТекстОшибки = "Неожиданный формат ответа от ЕЛМА: " + ТелоОтвета;
				
			КонецЕсли;
			
		Иначе
			
			ТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку("utf-8");
			Результат.ТекстОшибки = СтрШаблон("HTTP %1: %2", HTTPОтвет.КодСостояния, ТелоОтвета);
			
		КонецЕсли;
		
	Исключение
		
		Результат.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Отправляет документ в ЕЛМА, создавая процесс согласования приказа
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.УстановкаЦенНоменклатуры
//  AuthToken - Строка - токен авторизации ЕЛМА
//  ПараметрыПриказа - Структура - параметры из формы
//
// Возвращаемое значение:
//  Структура:
//   * Успех - Булево
//   * УИДЕЛМА - Строка - идентификатор процесса в ЕЛМА
//   * ТекстОшибки - Строка
//
Функция ОтправитьВЕЛМА(ДокументСсылка, AuthToken, ПараметрыПриказа) Экспорт
	
	Результат = Новый Структура("Успех, УИДЕЛМА, ТекстОшибки", Ложь, "", "");
	
	Попытка
		
		// Формирование JSON для отправки
		JSONДанные = СформироватьJSONДляЕЛМА(ДокументСсылка, ПараметрыПриказа);
		
		// Сериализация в строку
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, JSONДанные);
		JSONТекст = ЗаписьJSON.Закрыть();
		
		// Получение параметров подключения
		URL = ПЛ_ДополнительныеКонстантыПовтИсп.ВернутьДополнительнуюКонстанту("MRS_URLСервисаЕЛМА");
		ApplicationToken = ПЛ_ДополнительныеКонстантыПовтИсп.ВернутьДополнительнуюКонстанту("MRS_ApplicationTokenЕЛМА");
		Таймаут = Число(ПЛ_ДополнительныеКонстантыПовтИсп.ВернутьДополнительнуюКонстанту("MRS_ТаймаутЗапросаЕЛМА", 30));
		
		// Разбор URL для создания соединения
		СтруктураURL = СтроковыеФункцииКлиентСервер.СтруктураURI(URL);
		
		// Создание защищенного соединения для HTTPS
		ЗащищенноеСоединение = Неопределено;
		Если СтруктураURL.Схема = "https" Тогда
			ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено);
		КонецЕсли;
		
		// Создание HTTP-соединения
		Соединение = Новый HTTPСоединение(
			СтруктураURL.Имя,
			СтруктураURL.Порт,
			,
			,
			,
			Таймаут,
			ЗащищенноеСоединение);
		
		HTTPЗапрос = Новый HTTPЗапрос("/API/REST/Process/StartWithData");
		
		HTTPЗапрос.Заголовки.Вставить("ApplicationToken", ApplicationToken);
		HTTPЗапрос.Заголовки.Вставить("AuthToken", AuthToken);
		HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
		HTTPЗапрос.УстановитьТелоИзСтроки(JSONТекст, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
		
		// Выполнение запроса
		HTTPОтвет = Соединение.ВызватьHTTPМетод("POST", HTTPЗапрос);
		
		// Обработка ответа
		Если HTTPОтвет.КодСостояния = 200 Тогда
			
			ТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку("utf-8");
			
			// Парсинг JSON ответа
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
			ОтветJSON = ПрочитатьJSON(ЧтениеJSON);
			ЧтениеJSON.Закрыть();
			
			Если ТипЗнч(ОтветJSON) = Тип("Структура") Тогда
				
				// ЕЛМА может вернуть Uid или ProcessId
				Если ОтветJSON.Свойство("Uid") Тогда
					Результат.УИДЕЛМА = ОтветJSON.Uid;
				ИначеЕсли ОтветJSON.Свойство("ProcessId") Тогда
					Результат.УИДЕЛМА = Строка(ОтветJSON.ProcessId);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Результат.УИДЕЛМА) Тогда
					Результат.Успех = Истина;
				Иначе
					Результат.ТекстОшибки = "В ответе ЕЛМА отсутствует Uid или ProcessId: " + ТелоОтвета;
				КонецЕсли;
				
			Иначе
				
				Результат.ТекстОшибки = "Неожиданный формат ответа от ЕЛМА: " + ТелоОтвета;
				
			КонецЕсли;
			
		Иначе
			
			ТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку("utf-8");
			Результат.ТекстОшибки = СтрШаблон("HTTP %1: %2", HTTPОтвет.КодСостояния, ТелоОтвета);
			
		КонецЕсли;
		
	Исключение
		
		Результат.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Получает статус процесса из ЕЛМА
//
// Параметры:
//  УИДЕЛМА - Строка - идентификатор процесса в ЕЛМА
//  AuthToken - Строка - токен авторизации
//
// Возвращаемое значение:
//  Структура:
//   * Успех - Булево
//   * СтатусЕЛМА - Строка - статус процесса в ЕЛМА
//   * Комментарий - Строка - комментарий при отклонении
//   * ТекстОшибки - Строка
//
Функция ПолучитьСтатусИзЕЛМА(УИДЕЛМА, AuthToken) Экспорт
	
	Результат = Новый Структура("Успех, СтатусЕЛМА, Комментарий, ТекстОшибки", Ложь, "", "", "");
	
	Попытка
		
		// Получение параметров подключения
		URL = ПЛ_ДополнительныеКонстантыПовтИсп.ВернутьДополнительнуюКонстанту("MRS_URLСервисаЕЛМА");
		ApplicationToken = ПЛ_ДополнительныеКонстантыПовтИсп.ВернутьДополнительнуюКонстанту("MRS_ApplicationTokenЕЛМА");
		DecreeTypeUid = ПЛ_ДополнительныеКонстантыПовтИсп.ВернутьДополнительнуюКонстанту("MRS_DecreeTypeУИДЕЛМА");
		Таймаут = Число(ПЛ_ДополнительныеКонстантыПовтИсп.ВернутьДополнительнуюКонстанту("MRS_ТаймаутЗапросаЕЛМА", 30));
		
		// Формирование URL запроса
		URLЗапроса = СтрШаблон("/API/REST/Entity/Load?type=%1&id=%2", DecreeTypeUid, УИДЕЛМА);
		
		// Разбор URL для создания соединения
		СтруктураURL = СтроковыеФункцииКлиентСервер.СтруктураURI(URL);
		
		// Создание защищенного соединения для HTTPS
		ЗащищенноеСоединение = Неопределено;
		Если СтруктураURL.Схема = "https" Тогда
			ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено);
		КонецЕсли;
		
		// Создание HTTP-соединения
		Соединение = Новый HTTPСоединение(
			СтруктураURL.Имя,
			СтруктураURL.Порт,
			,
			,
			,
			Таймаут,
			ЗащищенноеСоединение);
		
		HTTPЗапрос = Новый HTTPЗапрос(URLЗапроса);
		
		HTTPЗапрос.Заголовки.Вставить("ApplicationToken", ApplicationToken);
		HTTPЗапрос.Заголовки.Вставить("AuthToken", AuthToken);
		
		// Выполнение запроса
		HTTPОтвет = Соединение.ВызватьHTTPМетод("GET", HTTPЗапрос);
		
		// Обработка ответа
		Если HTTPОтвет.КодСостояния = 200 Тогда
			
			ТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку("utf-8");
			
			// Парсинг JSON
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
			ОтветJSON = ПрочитатьJSON(ЧтениеJSON);
			ЧтениеJSON.Закрыть();
			
			Если ТипЗнч(ОтветJSON) = Тип("Структура") Тогда
				
				// Извлечение статуса из WorkflowInstance
				Если ОтветJSON.Свойство("WorkflowInstance") И ТипЗнч(ОтветJSON.WorkflowInstance) = Тип("Структура") Тогда
					
					Если ОтветJSON.WorkflowInstance.Свойство("Status") Тогда
						Результат.СтатусЕЛМА = ОтветJSON.WorkflowInstance.Status;
					КонецЕсли;
					
				КонецЕсли;
				
				// Извлечение комментария при отклонении
				Если ОтветJSON.Свойство("ApprovementResult") И ТипЗнч(ОтветJSON.ApprovementResult) = Тип("Структура") Тогда
					
					Если ОтветJSON.ApprovementResult.Свойство("Comment") Тогда
						Результат.Комментарий = ОтветJSON.ApprovementResult.Comment;
					КонецЕсли;
					
				КонецЕсли;
				
				Результат.Успех = Истина;
				
			Иначе
				
				Результат.ТекстОшибки = "Неожиданный формат ответа от ЕЛМА: " + ТелоОтвета;
				
			КонецЕсли;
			
		Иначе
			
			ТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку("utf-8");
			Результат.ТекстОшибки = СтрШаблон("HTTP %1: %2", HTTPОтвет.КодСостояния, ТелоОтвета);
			
		КонецЕсли;
		
	Исключение
		
		Результат.ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Отменяет приказ в ЕЛМА (при удалении документа в 1С)
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.УстановкаЦенНоменклатуры
//
// Возвращаемое значение:
//  Булево - Истина если отмена успешна
//
Функция ОтменитьПриказВЕЛМА(ДокументСсылка) Экспорт
	
	Попытка
		
		// Получить УИДЕЛМА из регистра
		СтатусДокумента = ПолучитьСтатусДокумента(ДокументСсылка);
		
		Если СтатусДокумента = Неопределено Или НЕ ЗначениеЗаполнено(СтатусДокумента.УИДЕЛМА) Тогда
			Возврат Истина; // Документ не отправлялся в ЕЛМА
		КонецЕсли;
		
		// Проверка текущего статуса
		Если СтатусДокумента.Статус = Перечисления.MRS_СтатусыСинхронизацииЕЛМА.Отменен Тогда
			Возврат Истина; // Уже отменен
		КонецЕсли;
		
		// Авторизация в ЕЛМА
		РезультатАвторизации = АвторизоватьсяВЕЛМА();
		Если НЕ РезультатАвторизации.Успех Тогда
			ЗаписатьЛог("Не удалось авторизоваться в ЕЛМА для отмены приказа: " + РезультатАвторизации.ТекстОшибки, 
				УровеньЖурналаРегистрации.Ошибка);
			Возврат Ложь;
		КонецЕсли;
		
		AuthToken = РезультатАвторизации.Токен;
		
		// Получение параметров
		URL = ПЛ_ДополнительныеКонстантыПовтИсп.ВернутьДополнительнуюКонстанту("MRS_URLСервисаЕЛМА");
		ApplicationToken = ПЛ_ДополнительныеКонстантыПовтИсп.ВернутьДополнительнуюКонстанту("MRS_ApplicationTokenЕЛМА");
		DecreeTypeUid = ПЛ_ДополнительныеКонстантыПовтИсп.ВернутьДополнительнуюКонстанту("MRS_DecreeTypeУИДЕЛМА");
		Таймаут = Число(ПЛ_ДополнительныеКонстантыПовтИсп.ВернутьДополнительнуюКонстанту("MRS_ТаймаутЗапросаЕЛМА", 30));
		
		// Формирование URL запроса
		URLЗапроса = СтрШаблон("/API/REST/Entity/Update/%1/%2", DecreeTypeUid, СтатусДокумента.УИДЕЛМА);
		
		// Формирование тела запроса
		ДанныеОтмены = Новый Структура;
		ДанныеОтмены.Вставить("Status", "Cancelled");
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, ДанныеОтмены);
		JSONТекст = ЗаписьJSON.Закрыть();
		
		// Разбор URL для создания соединения
		СтруктураURL = СтроковыеФункцииКлиентСервер.СтруктураURI(URL);
		
		// Создание защищенного соединения для HTTPS
		ЗащищенноеСоединение = Неопределено;
		Если СтруктураURL.Схема = "https" Тогда
			ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено);
		КонецЕсли;
		
		// Создание HTTP-соединения
		Соединение = Новый HTTPСоединение(
			СтруктураURL.Имя,
			СтруктураURL.Порт,
			,
			,
			,
			Таймаут,
			ЗащищенноеСоединение);
		
		HTTPЗапрос = Новый HTTPЗапрос(URLЗапроса);
		
		HTTPЗапрос.Заголовки.Вставить("ApplicationToken", ApplicationToken);
		HTTPЗапрос.Заголовки.Вставить("AuthToken", AuthToken);
		HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
		HTTPЗапрос.УстановитьТелоИзСтроки(JSONТекст, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
		
		// Выполнение запроса
		HTTPОтвет = Соединение.ВызватьHTTPМетод("POST", HTTPЗапрос);
		
		// Обработка ответа
		Если HTTPОтвет.КодСостояния = 200 Тогда
			
			// Обновление статуса в регистре
			НаборЗаписей = РегистрыСведений.MRS_ПроцессыЕЛМА.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Документ1С.Установить(ДокументСсылка);
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Количество() > 0 Тогда
				Запись = НаборЗаписей[0];
				Запись.Статус = Перечисления.MRS_СтатусыСинхронизацииЕЛМА.Отменен;
				Запись.СтатусЕЛМА = "Cancelled";
				НаборЗаписей.Записать();
			КонецЕсли;
			
			ЗаписатьЛог(СтрШаблон("Приказ %1 успешно отменен в ЕЛМА", СтатусДокумента.УИДЕЛМА), 
				УровеньЖурналаРегистрации.Информация);
			
			Возврат Истина;
			
		Иначе
			
			ТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку("utf-8");
			ЗаписатьЛог(СтрШаблон("Ошибка отмены приказа в ЕЛМА (HTTP %1): %2", 
				HTTPОтвет.КодСостояния, ТелоОтвета), УровеньЖурналаРегистрации.Ошибка);
			
			Возврат Ложь;
			
		КонецЕсли;
		
	Исключение
		
		ЗаписатьЛог("Ошибка отмены приказа в ЕЛМА: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), 
			УровеньЖурналаРегистрации.Ошибка);
		
		Возврат Ложь;
		
	КонецПопытки;
	
КонецФункции

#КонецОбласти

#Область ФормированиеДанных

// Формирует JSON-структуру для отправки в ЕЛМА
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.УстановкаЦенНоменклатуры
//  ПараметрыПриказа - Структура - параметры из формы
//
// Возвращаемое значение:
//  Структура - данные для отправки в ЕЛМА
//
Функция СформироватьJSONДляЕЛМА(ДокументСсылка, ПараметрыПриказа) Экспорт
	
	// Чтение документа
	Документ = ДокументСсылка.ПолучитьОбъект();
	
	// Получение вида цены из первой строки табличной части
	Если Документ.ЦеныНоменклатуры.Количество() = 0 Тогда
		ВызватьИсключение "В документе отсутствуют строки с ценами";
	КонецЕсли;
	
	ВидЦены = Документ.ЦеныНоменклатуры[0].ВидЦены;
	
	// Получение Uid организации через план обмена
	UidОрганизации = ПолучитьUidОрганизацииИзПланаОбмена(ВидЦены);
	
	// Получение Uid инициатора (текущего пользователя)
	UidИнициатора = ПолучитьUidТекущегоПользователяЕЛМА();
	
	// Получение Uid ответственного за исполнение
	UidОтветственного = Неопределено;
	Если ПараметрыПриказа.Свойство("ОтветственныйЗаИсполнение") 
		И ЗначениеЗаполнено(ПараметрыПриказа.ОтветственныйЗаИсполнение) Тогда
		
		UidОтветственного = ПолучитьUidФизЛицаЕЛМА(ПараметрыПриказа.ОтветственныйЗаИсполнение);
		
		Если НЕ ЗначениеЗаполнено(UidОтветственного) Тогда
			ВызватьИсключение "Для ответственного за исполнение не заполнен Uid ЕЛМА в РС.ДополнительныеКонстанты";
		КонецЕсли;
		
	КонецЕсли;
	
	// Получение массива Uid для ознакомления
	МассивUidДляОзнакомления = Новый Массив;
	Если ПараметрыПриказа.Свойство("СписокКОзнакомлению") 
		И ТипЗнч(ПараметрыПриказа.СписокКОзнакомлению) = Тип("ТаблицаЗначений") Тогда
		
		Для Каждого Строка Из ПараметрыПриказа.СписокКОзнакомлению Цикл
			
			Если ЗначениеЗаполнено(Строка.ФизическоеЛицо) Тогда
				
				Uid = ПолучитьUidФизЛицаЕЛМА(Строка.ФизическоеЛицо);
				
				Если ЗначениеЗаполнено(Uid) Тогда
					УзелUid = Новый Структура("Uid", Uid);
					МассивUidДляОзнакомления.Добавить(УзелUid);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Получение наименования организации
	Организация = ПолучитьОрганизациюИзПланаОбмена(ВидЦены);
	НаименованиеОрганизации = Организация.Наименование;
	
	// Формирование DecreeHeadline
	DecreeHeadline = СтрШаблон("Об установке цен для %1 с %2", 
		НаименованиеОрганизации, 
		Формат(Документ.ДатаНачалаДействия, "ДФ=dd.MM.yyyy"));
	
	// Формирование DecreeContent
	DecreeContent = СформироватьDecreeContent(ДокументСсылка);
	
	// Формирование Word-файла приказа
	ДвоичныеДанныеWord = СформироватьWordФайлПриказа(ДокументСсылка, ПараметрыПриказа);
	FileBase64 = Base64Строка(ДвоичныеДанныеWord);
	
	// Получение констант
	ProcessToken = ПЛ_ДополнительныеКонстантыПовтИсп.ВернутьДополнительнуюКонстанту("MRS_ProcessTokenЕЛМА");
	DecreeTypeUid = ПЛ_ДополнительныеКонстантыПовтИсп.ВернутьДополнительнуюКонстанту("MRS_DecreeTypeУИДЕЛМА");
	
	// Формирование структуры Context
	Context = Новый Структура;
	Context.Вставить("Organization", Новый Структура("Uid", UidОрганизации));
	Context.Вставить("Initiator", Новый Структура("Uid", UidИнициатора));
	Context.Вставить("DecreeType", Новый Структура("Uid", DecreeTypeUid));
	Context.Вставить("DecreeHeadline", DecreeHeadline);
	Context.Вставить("Preamble", "В целях актуализации прейскуранта");
	Context.Вставить("DecreeContent", DecreeContent);
	Context.Вставить("StartDate", XMLСтрока(Документ.ДатаНачалаДействия)); // ISO 8601
	
	Если ЗначениеЗаполнено(UidОтветственного) Тогда
		Context.Вставить("DecreeResponsible", Новый Структура("Uid", UidОтветственного));
	КонецЕсли;
	
	Если МассивUidДляОзнакомления.Количество() > 0 Тогда
		Context.Вставить("NotificationUsr", МассивUidДляОзнакомления);
	КонецЕсли;
	
	Context.Вставить("FileDecree", FileBase64);
	
	// Формирование итоговой структуры
	Результат = Новый Структура;
	Результат.Вставить("ProcessToken", ProcessToken);
	Результат.Вставить("Context", Context);
	
	Возврат Результат;
	
КонецФункции

// Формирует текст приказа (DecreeContent)
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.УстановкаЦенНоменклатуры
//
// Возвращаемое значение:
//  Строка - текст приказа
//
Функция СформироватьDecreeContent(ДокументСсылка) Экспорт
	
	ТекстПриказа = 
		"1. Установить цены согласно приложению №1." + Символы.ПС +
		"2. Контроль за внесением изменений возложить на финансового контролера." + Символы.ПС +
		"3. Контроль за исполнением приказа возложить на директора департамента.";
	
	Возврат ТекстПриказа;
	
КонецФункции

// Формирует Word-файл приказа из шаблона
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.УстановкаЦенНоменклатуры
//  ПараметрыПриказа - Структура
//
// Возвращаемое значение:
//  ДвоичныеДанные - файл DOCX
//
Функция СформироватьWordФайлПриказа(ДокументСсылка, ПараметрыПриказа) Экспорт
	
	// TODO: Реализовать генерацию Word-документа из шаблона
	// Пока возвращаем пустой файл для тестирования
	
	ТекстДокумента = "Приказ об установке цен от " + Формат(ТекущаяДатаСеанса(), "ДФ=dd.MM.yyyy");
	
	ВременныйФайл = ПолучитьИмяВременногоФайла("txt");
	
	Попытка
		
		ЗаписьТекста = Новый ЗаписьТекста(ВременныйФайл, КодировкаТекста.UTF8);
		ЗаписьТекста.Записать(ТекстДокумента);
		ЗаписьТекста.Закрыть();
		
		ДвоичныеДанные = Новый ДвоичныеДанные(ВременныйФайл);
		
		УдалитьФайлы(ВременныйФайл);
		
		Возврат ДвоичныеДанные;
		
	Исключение
		
		ЗаписатьЛог("Ошибка формирования Word-файла: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), 
			УровеньЖурналаРегистрации.Ошибка);
		
		// Возвращаем пустые данные
		Возврат Новый ДвоичныеДанные("");
		
	КонецПопытки;
	
КонецФункции

#КонецОбласти

#Область РаботаСУид

// Получает Uid организации через план обмена питУдаленныеКассы
//
// Параметры:
//  ВидЦены - СправочникСсылка.ВидыЦен
//
// Возвращаемое значение:
//  Строка - Uid организации в ЕЛМА
//
Функция ПолучитьUidОрганизацииИзПланаОбмена(ВидЦены) Экспорт
	
	// Запрос к плану обмена
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	питУдаленныеКассы.Организация КАК Организация
		|ИЗ
		|	ПланОбмена.питУдаленныеКассы КАК питУдаленныеКассы
		|ГДЕ
		|	питУдаленныеКассы.ВидЦен = &ВидЦены";
	
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		ВызватьИсключение СтрШаблон("Не найден узел плана обмена питУдаленныеКассы для вида цены %1", ВидЦены);
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Организация = Выборка.Организация;
	
	// Получение Uid из РС.ДополнительныеКонстанты
	UidОрганизации = ПЛ_ДополнительныеКонстантыПовтИсп.ВернутьДополнительнуюКонстанту(
		"MRS_УИДЕЛМА_Организация", 
		Организация);
	
	Если НЕ ЗначениеЗаполнено(UidОрганизации) Тогда
		ВызватьИсключение СтрШаблон(
			"Для организации %1 не заполнен Uid ЕЛМА в РС.ДополнительныеКонстанты. " +
			"Добавьте запись с ИмяКонстанты='MRS_УИДЕЛМА_Организация' и Объект=Организация.",
			Организация);
	КонецЕсли;
	
	Возврат UidОрганизации;
	
КонецФункции

// Получает организацию из плана обмена по виду цены
//
// Параметры:
//  ВидЦены - СправочникСсылка.ВидыЦен
//
// Возвращаемое значение:
//  СправочникСсылка.Организации
//
Функция ПолучитьОрганизациюИзПланаОбмена(ВидЦены) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	питУдаленныеКассы.Организация КАК Организация
		|ИЗ
		|	ПланОбмена.питУдаленныеКассы КАК питУдаленныеКассы
		|ГДЕ
		|	питУдаленныеКассы.ВидЦен = &ВидЦены";
	
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		ВызватьИсключение СтрШаблон("Не найден узел плана обмена питУдаленныеКассы для вида цены %1", ВидЦены);
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Организация;
	
КонецФункции

// Получает Uid физического лица из РС.ДополнительныеКонстанты
//
// Параметры:
//  ФизЛицоСсылка - СправочникСсылка.ФизическиеЛица
//
// Возвращаемое значение:
//  Строка - Uid физлица в ЕЛМА или Неопределено
//
Функция ПолучитьUidФизЛицаЕЛМА(ФизЛицоСсылка) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ФизЛицоСсылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Uid = ПЛ_ДополнительныеКонстантыПовтИсп.ВернутьДополнительнуюКонстанту(
		"MRS_УИДЕЛМА_ФизЛицо", 
		ФизЛицоСсылка);
	
	Если НЕ ЗначениеЗаполнено(Uid) Тогда
		
		ЗаписатьЛог(СтрШаблон("Для физлица %1 не заполнен Uid ЕЛМА в РС.ДополнительныеКонстанты", 
			ФизЛицоСсылка), УровеньЖурналаРегистрации.Предупреждение);
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Возврат Uid;
	
КонецФункции

// Получает Uid текущего пользователя из РС.ДополнительныеКонстанты
//
// Возвращаемое значение:
//  Строка - Uid инициатора в ЕЛМА
//
Функция ПолучитьUidТекущегоПользователяЕЛМА() Экспорт
	
	ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	
	// Получение физического лица текущего пользователя
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Ссылка,
		|	Пользователи.ФизическоеЛицо КАК ФизическоеЛицо
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.ИдентификаторПользователяИБ = &ИдентификаторПользователяИБ";
	
	Запрос.УстановитьПараметр("ИдентификаторПользователяИБ", ТекущийПользователь.УникальныйИдентификатор);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		ВызватьИсключение "Не найден пользователь 1С для текущего пользователя ИБ";
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	ФизЛицо = Выборка.ФизическоеЛицо;
	
	Если НЕ ЗначениеЗаполнено(ФизЛицо) Тогда
		ВызватьИсключение СтрШаблон("У текущего пользователя %1 не заполнено ФизическоеЛицо", Выборка.Ссылка);
	КонецЕсли;
	
	Uid = ПолучитьUidФизЛицаЕЛМА(ФизЛицо);
	
	Если НЕ ЗначениеЗаполнено(Uid) Тогда
		ВызватьИсключение СтрШаблон(
			"Для физлица %1 текущего пользователя не заполнен Uid ЕЛМА в РС.ДополнительныеКонстанты. " +
			"Добавьте запись с ИмяКонстанты='MRS_УИДЕЛМА_ФизЛицо' и Объект=ФизическоеЛицо.",
			ФизЛицо);
	КонецЕсли;
	
	Возврат Uid;
	
КонецФункции

#КонецОбласти

#Область ПроведениеИВыгрузка

// Проводит документы, у которых наступила дата применения
//
// Возвращаемое значение:
//  Структура:
//   * Проведено - Число
//   * Ошибок - Число
//
Функция ПровестиДокументыПоДатеПрименения() Экспорт
	
	Результат = Новый Структура("Проведено, Ошибок", 0, 0);
	
	// Выборка документов для проведения
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроцессыЕЛМА.Документ1С КАК Документ1С,
		|	Документ.ДатаНачалаДействия КАК ДатаНачалаДействия
		|ИЗ
		|	РегистрСведений.MRS_ПроцессыЕЛМА КАК ПроцессыЕЛМА
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УстановкаЦенНоменклатуры КАК Документ
		|		ПО ПроцессыЕЛМА.Документ1С = Документ.Ссылка
		|ГДЕ
		|	ПроцессыЕЛМА.Статус = ЗНАЧЕНИЕ(Перечисление.MRS_СтатусыСинхронизацииЕЛМА.Подписан)
		|	И Документ.ДатаНачалаДействия <= &ТекущаяДата
		|	И НЕ Документ.Проведен";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			
			// Проведение документа
			ДокументОбъект = Выборка.Документ1С.ПолучитьОбъект();
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
			ЗаписатьЛог(СтрШаблон("Документ %1 успешно проведен по дате применения", Выборка.Документ1С), 
				УровеньЖурналаРегистрации.Информация);
			
			Результат.Проведено = Результат.Проведено + 1;
			
			// Выгрузка цен в Simphony
			Попытка
				ВыгрузитьЦеныВSimphony(Выборка.Документ1С);
			Исключение
				ЗаписатьЛог(СтрШаблон("Ошибка выгрузки цен в Simphony для документа %1: %2", 
					Выборка.Документ1С, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())), 
					УровеньЖурналаРегистрации.Ошибка);
			КонецПопытки;
			
		Исключение
			
			ЗаписатьЛог(СтрШаблон("Ошибка проведения документа %1: %2", 
				Выборка.Документ1С, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())), 
				УровеньЖурналаРегистрации.Ошибка);
			
			Результат.Ошибок = Результат.Ошибок + 1;
			
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Выгружает цены из документа в Simphony
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.УстановкаЦенНоменклатуры
//
// Возвращаемое значение:
//  Булево - Истина если выгрузка выполнена
//
Функция ВыгрузитьЦеныВSimphony(ДокументСсылка) Экспорт
	
	// Проверка условий
	Если НЕ ДокументСсылка.Проведен Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СтатусДокумента = ПолучитьСтатусДокумента(ДокументСсылка);
	Если СтатусДокумента = Неопределено 
		Или СтатусДокумента.Статус <> Перечисления.MRS_СтатусыСинхронизацииЕЛМА.Подписан Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Получение видов цен из документа
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УстановкаЦен.ВидЦены КАК ВидЦены
		|ИЗ
		|	Документ.УстановкаЦенНоменклатуры.ЦеныНоменклатуры КАК УстановкаЦен
		|ГДЕ
		|	УстановкаЦен.Ссылка = &Документ";
	
	Запрос.УстановитьПараметр("Документ", ДокументСсылка);
	
	ВыборкаВидовЦен = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаВидовЦен.Следующий() Цикл
		
		ВидЦены = ВыборкаВидовЦен.ВидЦены;
		
		// Поиск кассовых узлов с этим видом цены
		ЗапросУзлов = Новый Запрос;
		ЗапросУзлов.Текст = 
			"ВЫБРАТЬ
			|	питУдаленныеКассы.Ссылка КАК КассовыйУзел,
			|	питУдаленныеКассыВидыМеню.ВидМеню КАК ВидМеню
			|ИЗ
			|	ПланОбмена.питУдаленныеКассы КАК питУдаленныеКассы
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланОбмена.питУдаленныеКассы.ВидыМеню КАК питУдаленныеКассыВидыМеню
			|		ПО питУдаленныеКассы.Ссылка = питУдаленныеКассыВидыМеню.Ссылка
			|ГДЕ
			|	питУдаленныеКассы.ВидЦен = &ВидЦены";
		
		ЗапросУзлов.УстановитьПараметр("ВидЦены", ВидЦены);
		
		ВыборкаУзлов = ЗапросУзлов.Выполнить().Выбрать();
		
		Пока ВыборкаУзлов.Следующий() Цикл
			
			КассовыйУзел = ВыборкаУзлов.КассовыйУзел;
			ВидМеню = ВыборкаУзлов.ВидМеню;
			
			// Получение позиций меню для данного вида меню
			ЗапросПозиций = Новый Запрос;
			ЗапросПозиций.Текст = 
				"ВЫБРАТЬ
				|	питМеню.Ссылка КАК ПозицияМеню,
				|	питМеню.Номенклатура КАК Номенклатура
				|ИЗ
				|	Справочник.питМеню КАК питМеню
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УстановкаЦенНоменклатуры.ЦеныНоменклатуры КАК УстановкаЦен
				|		ПО питМеню.Номенклатура = УстановкаЦен.Номенклатура
				|ГДЕ
				|	питМеню.Владелец = &ВидМеню
				|	И НЕ питМеню.ЭтоГруппа
				|	И УстановкаЦен.Ссылка = &Документ
				|	И УстановкаЦен.ВидЦены = &ВидЦены";
			
			ЗапросПозиций.УстановитьПараметр("ВидМеню", ВидМеню);
			ЗапросПозиций.УстановитьПараметр("Документ", ДокументСсылка);
			ЗапросПозиций.УстановитьПараметр("ВидЦены", ВидЦены);
			
			ВыборкаПозиций = ЗапросПозиций.Выполнить().Выбрать();
			
			Пока ВыборкаПозиций.Следующий() Цикл
				
				// Постановка позиции в очередь выгрузки Simphony
				MRS_ИнтеграцияSimphonyСервер.ПоставитьВОчередьВыгрузки(
					ВыборкаПозиций.ПозицияМеню,
					КассовыйУзел,
					"Изменение");
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ЗаписатьЛог(СтрШаблон("Цены из документа %1 поставлены в очередь выгрузки Simphony", ДокументСсылка), 
		УровеньЖурналаРегистрации.Информация);
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Проверяет, требуется ли отправка документа в ЕЛМА
//
// Параметры:
//  Документ - ДокументОбъект.УстановкаЦенНоменклатуры
//
// Возвращаемое значение:
//  Булево - Истина если требуется отправка в ЕЛМА
//
Функция ТребуетсяОтправкаВЕЛМА(Документ) Экспорт
	
	// Проверяем, есть ли виды цен, привязанные к питУдаленныеКассы
	Если Документ.Товары.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Получаем уникальные виды цен из документа
	МассивВидовЦен = Новый Массив;
	Для Каждого Строка Из Документ.ВидыЦен Цикл
		Если НЕ МассивВидовЦен.Найти(Строка.ВидЦены) = Неопределено Тогда
			МассивВидовЦен.Добавить(Строка.ВидЦены);
		КонецЕсли;
	КонецЦикла;
	
	// Проверяем наличие видов цен в плане обмена
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	питУдаленныеКассы.ВидЦен КАК ВидЦен,
		|	питУдаленныеКассы.Организация КАК Организация
		|ИЗ
		|	ПланОбмена.питУдаленныеКассы КАК питУдаленныеКассы
		|ГДЕ
		|	питУдаленныеКассы.ВидЦен В(&МассивВидовЦен)";
	
	Запрос.УстановитьПараметр("МассивВидовЦен", МассивВидовЦен);
	
	Результат = Запрос.Выполнить();
	
	Возврат НЕ Результат.Пустой();
	
КонецФункции

// Валидирует документ и параметры приказа перед отправкой в ЕЛМА
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.УстановкаЦенНоменклатуры
//  ПараметрыПриказа - Структура:
//   * ОтветственныйЗаИсполнение - СправочникСсылка.ФизическиеЛица
//   * СписокКОзнакомлению - ТаблицаЗначений
//
// Возвращаемое значение:
//  Структура:
//   * Успех - Булево - Истина если валидация прошла успешно
//   * МассивОшибок - Массив из Строка - список ошибок валидации
//
Функция ВалидироватьДокументПередОтправкой(ДокументСсылка, ПараметрыПриказа) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Успех", Истина);
	Результат.Вставить("МассивОшибок", Новый Массив);
	
	Попытка
		
		// Получаем объект документа
		Документ = ДокументСсылка.ПолучитьОбъект();
		
		// Вызываем базовую валидацию из клиент-серверного модуля
		РезультатБазовойВалидации = MRS_ИнтеграцияЕЛМАКлиентСервер.ВалидироватьДокументПередОтправкой(
			Документ, 
			ПараметрыПриказа);
		
		// Добавляем ошибки базовой валидации
		Если НЕ РезультатБазовойВалидации.Успех Тогда
			
			Для Каждого Ошибка Из РезультатБазовойВалидации.МассивОшибок Цикл
				Результат.МассивОшибок.Добавить(Ошибка);
			КонецЦикла;
			
		КонецЕсли;
		
		// === Дополнительные серверные проверки (Uid в ЕЛМА) ===
		
		Если Документ.ЦеныНоменклатуры.Количество() > 0 Тогда
			
			ВидЦены = Документ.ЦеныНоменклатуры[0].ВидЦены;
			
			// Проверка наличия Uid организации
			Попытка
				UidОрганизации = ПолучитьUidОрганизацииИзПланаОбмена(ВидЦены);
			Исключение
				Результат.МассивОшибок.Добавить(ОписаниеОшибки());
			КонецПопытки;
			
		КонецЕсли;
		
		// Проверка наличия Uid текущего пользователя (инициатора)
		Попытка
			UidИнициатора = ПолучитьUidТекущегоПользователяЕЛМА();
		Исключение
			Результат.МассивОшибок.Добавить("Не удалось получить Uid инициатора: " + ОписаниеОшибки());
		КонецПопытки;
		
		// Проверка наличия Uid ответственного за исполнение
		Если ПараметрыПриказа.Свойство("ОтветственныйЗаИсполнение") 
			И ЗначениеЗаполнено(ПараметрыПриказа.ОтветственныйЗаИсполнение) Тогда
			
			UidОтветственного = ПолучитьUidФизЛицаЕЛМА(ПараметрыПриказа.ОтветственныйЗаИсполнение);
			
			Если НЕ ЗначениеЗаполнено(UidОтветственного) Тогда
				Результат.МассивОшибок.Добавить(СтрШаблон(
					"Для ответственного ""%1"" не заполнен Uid ЕЛМА в РС.ДополнительныеКонстанты",
					ПараметрыПриказа.ОтветственныйЗаИсполнение));
			КонецЕсли;
			
		КонецЕсли;
		
		// Проверка Uid для списка к ознакомлению
		Если ПараметрыПриказа.Свойство("СписокКОзнакомлению") 
			И ТипЗнч(ПараметрыПриказа.СписокКОзнакомлению) = Тип("ТаблицаЗначений") Тогда
			
			Для Каждого СтрокаСписка Из ПараметрыПриказа.СписокКОзнакомлению Цикл
				
				Если ЗначениеЗаполнено(СтрокаСписка.ФизическоеЛицо) Тогда
					
					UidФизЛица = ПолучитьUidФизЛицаЕЛМА(СтрокаСписка.ФизическоеЛицо);
					
					Если НЕ ЗначениеЗаполнено(UidФизЛица) Тогда
						Результат.МассивОшибок.Добавить(СтрШаблон(
							"Для физлица ""%1"" в списке к ознакомлению не заполнен Uid ЕЛМА в РС.ДополнительныеКонстанты",
							СтрокаСписка.ФизическоеЛицо));
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	Исключение
		
		Результат.МассивОшибок.Добавить("Непредвиденная ошибка: " + ОписаниеОшибки());
		
	КонецПопытки;
	
	Результат.Успех = (Результат.МассивОшибок.Количество() = 0);
	
	Возврат Результат;
	
КонецФункции

// Преобразует статус ЕЛМА в статус 1С
//
// Параметры:
//  СтатусЕЛМА - Строка - статус процесса в ЕЛМА
//
// Возвращаемое значение:
//  ПеречислениеСсылка.MRS_СтатусыСинхронизацииЕЛМА
//
Функция ПреобразоватьСтатусЕЛМАВСтатус1С(СтатусЕЛМА) Экспорт
	
	// Маппинг статусов ЕЛМА → 1С
	Если СтатусЕЛМА = "InProgress" Или СтатусЕЛМА = "Active" Тогда
		Возврат Перечисления.MRS_СтатусыСинхронизацииЕЛМА.НаСогласовании;
		
	ИначеЕсли СтатусЕЛМА = "Approved" Тогда
		Возврат Перечисления.MRS_СтатусыСинхронизацииЕЛМА.Согласован;
		
	ИначеЕсли СтатусЕЛМА = "Signed" Или СтатусЕЛМА = "Completed" Тогда
		Возврат Перечисления.MRS_СтатусыСинхронизацииЕЛМА.Подписан;
		
	ИначеЕсли СтатусЕЛМА = "Rejected" Тогда
		Возврат Перечисления.MRS_СтатусыСинхронизацииЕЛМА.Отклонен;
		
	ИначеЕсли СтатусЕЛМА = "Cancelled" Тогда
		Возврат Перечисления.MRS_СтатусыСинхронизацииЕЛМА.Отменен;
		
	Иначе
		// Неизвестный статус, оставляем На согласовании
		Возврат Перечисления.MRS_СтатусыСинхронизацииЕЛМА.НаСогласовании;
		
	КонецЕсли;
	
КонецФункции

// Отправляет email-уведомление о смене статуса
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.УстановкаЦенНоменклатуры
//  НовыйСтатус - ПеречислениеСсылка.MRS_СтатусыСинхронизацииЕЛМА
//
Процедура ОтправитьEmailУведомлениеОСменеСтатуса(ДокументСсылка, НовыйСтатус) Экспорт
	
	// TODO: Реализовать отправку email через БСП
	// Пока просто логируем событие
	
	ЗаписатьЛог(СтрШаблон("Статус документа %1 изменен на %2", ДокументСсылка, НовыйСтатус), 
		УровеньЖурналаРегистрации.Информация);
	
КонецПроцедуры

// Записывает сообщение в журнал регистрации
//
// Параметры:
//  Сообщение - Строка - текст сообщения
//  Уровень - УровеньЖурналаРегистрации - уровень важности
//
Процедура ЗаписатьЛог(Сообщение, Уровень = Неопределено) Экспорт
	
	Если Уровень = Неопределено Тогда
		Уровень = УровеньЖурналаРегистрации.Информация;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации("MRS.ЕЛМА", Уровень,,, Сообщение);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
